// Установка nodeJS

// При установки nodeJS - автоматически устанавливается и npm

// 1) node -v - проверка устаовлен ли node
// 2) npm -v - посмотреть какая версия стоит на компе


//Загрузка проэкта

// 1)npx create-react-app 'name folder' - загружаем настроенную библиотеку под проэкт
// 2)cd 'name folder'
// 3)npm run start - запускаем проэкт
// 4) npm install -g create-react-app - глобальная установка 

// ls, dir - просмотр папок и файлов в текущей папке

// cd "путь к папке" - перейти в папку


 